---
type: FabricationPartRouteEnd
namespace: Autodesk.Revit.DB.Fabrication
version: 2024
members: 4
tags: [revit-api, class]
---

# FabricationPartRouteEnd

`Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateFromCenterline | 2017 | `public static FabricationPartRouteEnd CreateFromCenterline ( Element element , XYZ ptAt )` |
| Method | CreateFromConnector | 2017 | `public static FabricationPartRouteEnd CreateFromConnector ( Connector connnector )` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |